cases/Day-2/Part_2.3_waterOilEvaporation/waterOilEvaporationHeatFlux/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication setFields

# runApplication $(getApplication)

decomposePar

mpirun -np 4 $(getApplication) -parallel > sim.log

#------------------------------------------------------------------------------
